CSI API ETABS v1
cPropFrame.GetAllFrameProperties_2 Method
 Retrieves select data for all frame properties in the model, supersedes GetAllFrameProperties(Int32, String[], eFramePropType[], Double[], Double[], Double[], Double[], Double[], Double[])
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllFrameProperties_2(
	ref int NumberNames,
	ref string[] MyName,
	ref eFramePropType[] PropType,
	ref double[] t3,
	ref double[] t2,
	ref double[] tf,
	ref double[] tw,
	ref double[] t2b,
	ref double[] tfb,
	ref double[] Area
)
Function GetAllFrameProperties_2 (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef PropType As eFramePropType(),
	ByRef t3 As Double(),
	ByRef t2 As Double(),
	ByRef tf As Double(),
	ByRef tw As Double(),
	ByRef t2b As Double(),
	ByRef tfb As Double(),
	ByRef Area As Double()
) As Integer
Dim instance As cPropFrame
Dim NumberNames As Integer
Dim MyName As String()
Dim PropType As eFramePropType()
Dim t3 As Double()
Dim t2 As Double()
Dim tf As Double()
Dim tw As Double()
Dim t2b As Double()
Dim tfb As Double()
Dim Area As Double()
Dim returnValue As Integer
returnValue = instance.GetAllFrameProperties_2(NumberNames,
	MyName, PropType, t3, t2, tf, tw, t2b,
	tfb, Area)
int GetAllFrameProperties_2(
	int% NumberNames,
	array<String^>^% MyName,
	array<eFramePropType>^% PropType,
	array<double>^% t3,
	array<double>^% t2,
	array<double>^% tf,
	array<double>^% tw,
	array<double>^% t2b,
	array<double>^% tfb,
	array<double>^% Area
)
abstract GetAllFrameProperties_2 :
        NumberNames : int byref *
        MyName : string[] byref *
        PropType : eFramePropType[] byref *
        t3 : float[] byref *
        t2 : float[] byref *
        tf : float[] byref *
        tw : float[] byref *
        t2b : float[] byref *
        tfb : float[] byref *
        Area : float[] byref -> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
PropType
Type: ETABSv1.eFramePropType[]
t3
Type: System.Double[]
t2
Type: System.Double[]
tf
Type: System.Double[]
tw
Type: System.Double[]
t2b
Type: System.Double[]
tfb
Type: System.Double[]
Area
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace